Santroller/Santroller/src/pico/pins_arduino.h
#pragma once
// TODO: make this correct also, once we have these pins we need to configure i2c and spi to use them.
#define NUM_DIGITAL_PINS 26
#define NUM_ANALOG_INPUTS 3
#define PIN_WIRE_SDA 1
#define PIN_WIRE_SCL 1
#define PIN_SPI_MOSI 1
#define PIN_SPI_MISO 1
#define PIN_SPI_SCK 1
#define PIN_SPI_SS 1
#define PIN_A0 1